
module.exports = [
    /** 获取日报、月报数据
     * @param {string} type 类型，daily：返回日报数据，monthly：返回月报数据
     * @param {string} date 日期，如果需要返回日报数据就传入2023-11-22，如果需要月报数据就传入2023-11 
     */
    {
        url: '/edge/getDailyDataOfCity',
        methods: 'post',
        response: (ctx) => {
            return {
                "error": 0,
                "msg": "操作成功",
                "data": {
                    "sendingRateData": [
                        {
                            "city": " 中山",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        },
                        {
                            "city": "深圳",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        },
                        {
                            "city": "贝蒂",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        }
                    ],
                    "receivingRateData": [
                        {
                            "city": " 中山",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        },
                        {
                            "city": "深圳",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        }
                    ],
                    "totalFlowData": [
                        {
                            "city": " 中1山",
                            "peakValue": "1.3113",
                            "avgValue": "2.33",
                            unit:"GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 15.33"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 16.33"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 17.33"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 18.33"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 19.33"
                                },
                                {
                                    "time": " 2024-11-22 20时",
                                    "data": " 29.33"
                                }
                            ]
                        },
                        {
                            "city": "深圳",
                            "peakValue": "666666.33GB/s",
                            "avgValue": "666666.33GB/s",
                            "hourlyData": [
                                {
                                    "time": " 2023-11-22 15时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 16时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 17时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 18时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 19时",
                                    "data": " 666666.33GB/s"
                                },
                                {
                                    "time": " 2023-11-22 20时",
                                    "data": " 666666.33GB/s"
                                }
                            ]
                        }
                    ]
                }
            }
        },
    },
    /** 实时流量
     * @param {string|null} direction 流量方向,sendingRate返回发送速率数据，receivingRate返回接收速率数据，传入空或其他值默认收发速率数据都一起返回
     */
    {
        url: '/edge/getRealTimeTraffic',
        methods: 'post',
        response: (ctx) => {
            const {direction } = ctx.request.body
            if (direction === 'sendingRate') {
                return {
                    "error": 0,
                    "msg": "这是sendingRate",
                    "data": {
                    "realTimeTrafficData": [
                        {
                            "unit": "GB/s",
                            "city": "发送湛江",
                            "value": "239.939"
                        },
                        {
                            "unit": "GB/s",
                            "city": "茂名",
                            "value": "256.141"
                        },
                        {
                            "unit": "GB/s",
                            "city": "江门",
                            "value": "241.28"
                        },
                        {
                            "unit": "GB/s",
                            "city": "中山",
                            "value": "24.247"
                        },
                        {
                            "unit": "GB/s",
                            "city": "深圳",
                            "value": "29.377"
                        }
                    ],
                    "peakFlowData": [
                        {
                            "unit": "GB/s",
                            "city": "发送湛江",
                            "value": "1039.939"
                        },
                        {
                            "unit": "GB/s",
                            "city": "茂名",
                            "value": "1056.141"
                        },
                        {
                            "unit": "GB/s",
                            "city": "江门",
                            "value": "1241.28"
                        },
                        {
                            "unit": "GB/s",
                            "city": "中山",
                            "value": "654.247"
                        },
                        {
                            "unit": "GB/s",
                            "city": "深圳",
                            "value": "779.377"
                        }
                    ],
                    "cityFlowChartData": {
                        "sendingRateData": [
                            {
                                "unit": "GB/s",
                                "city": "江门",
                                "cityData": [
                                    {
                                        "data": 636.667,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 622,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "茂名",
                                "cityData": [
                                    {
                                        "data": 580.656,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "深圳",
                                "cityData": [
                                    {
                                        "data": 405.188,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "中山",
                                "cityData": [
                                    {
                                        "data": 327.465,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "发送湛江",
                                "cityData": [
                                    {
                                        "data": 578.207,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700798400
                                    }
                                ]
                            }
                        ],
                    }
                }
                }
            }
            if (direction === 'receivingRate') {
                return {
                    "error": 0,
                    "msg": "这是receivingRate",
                    "data": {
                        "realTimeTrafficData": [
                            {
                                "unit": "GB/s",
                                "city": "湛江",
                                "value": "1039.939"
                            },
                            {
                                "unit": "GB/s",
                                "city": "茂名",
                                "value": "1056.141"
                            },
                            {
                                "unit": "GB/s",
                                "city": "江门",
                                "value": "1241.28"
                            },
                            {
                                "unit": "GB/s",
                                "city": "中山",
                                "value": "654.247"
                            },
                            {
                                "unit": "GB/s",
                                "city": "深圳",
                                "value": "779.377"
                            }
                        ],
                        "peakFlowData": [
                            {
                                "unit": "GB/s",
                                "city": "湛江",
                                "value": "1039.939"
                            },
                            {
                                "unit": "GB/s",
                                "city": "茂名",
                                "value": "1056.141"
                            },
                            {
                                "unit": "GB/s",
                                "city": "江门",
                                "value": "1241.28"
                            },
                            {
                                "unit": "GB/s",
                                "city": "中山",
                                "value": "654.247"
                            },
                            {
                                "unit": "GB/s",
                                "city": "深圳",
                                "value": "779.377"
                            }
                        ],
                        "cityFlowChartData": {
                            "receivingRateData": [
                                {
                                    "unit": "GB/s",
                                    "city": "江门",
                                    "cityData": [
                                        {
                                            "data": 636.667,
                                            "time": 1700715600
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700719200
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700722800
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700726400
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700730000
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700733600
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700737200
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700740800
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700744400
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700748000
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700751600
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700755200
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700758800
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700762400
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700766000
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700769600
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700773200
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700776800
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700780400
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700784000
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700787600
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700791200
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700794800
                                        },
                                        {
                                            "data": 636.667,
                                            "time": 1700798400
                                        }
                                    ]
                                },
                                {
                                    "unit": "GB/s",
                                    "city": "茂名",
                                    "cityData": [
                                        {
                                            "data": 580.656,
                                            "time": 1700715600
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700719200
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700722800
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700726400
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700730000
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700733600
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700737200
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700740800
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700744400
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700748000
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700751600
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700755200
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700758800
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700762400
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700766000
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700769600
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700773200
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700776800
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700780400
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700784000
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700787600
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700791200
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700794800
                                        },
                                        {
                                            "data": 580.656,
                                            "time": 1700798400
                                        }
                                    ]
                                },
                                {
                                    "unit": "GB/s",
                                    "city": "深圳",
                                    "cityData": [
                                        {
                                            "data": 405.188,
                                            "time": 1700715600
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700719200
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700722800
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700726400
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700730000
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700733600
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700737200
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700740800
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700744400
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700748000
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700751600
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700755200
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700758800
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700762400
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700766000
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700769600
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700773200
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700776800
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700780400
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700784000
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700787600
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700791200
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700794800
                                        },
                                        {
                                            "data": 405.188,
                                            "time": 1700798400
                                        }
                                    ]
                                },
                                {
                                    "unit": "GB/s",
                                    "city": "中山",
                                    "cityData": [
                                        {
                                            "data": 327.465,
                                            "time": 1700715600
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700719200
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700722800
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700726400
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700730000
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700733600
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700737200
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700740800
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700744400
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700748000
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700751600
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700755200
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700758800
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700762400
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700766000
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700769600
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700773200
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700776800
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700780400
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700784000
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700787600
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700791200
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700794800
                                        },
                                        {
                                            "data": 327.465,
                                            "time": 1700798400
                                        }
                                    ]
                                },
                                {
                                    "unit": "GB/s",
                                    "city": "湛江",
                                    "cityData": [
                                        {
                                            "data": 578.207,
                                            "time": 1700715600
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700719200
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700722800
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700726400
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700730000
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700733600
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700737200
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700740800
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700744400
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700748000
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700751600
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700755200
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700758800
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700762400
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700766000
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700769600
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700773200
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700776800
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700780400
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700784000
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700787600
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700791200
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700794800
                                        },
                                        {
                                            "data": 578.207,
                                            "time": 1700798400
                                        }
                                    ]
                                }
                            ]
                        }
                    }
                }
            }
            return {
                "error": 0,
                "msg": "操作成功",
                "data": {
                    "realTimeTrafficData": [
                        {
                            "unit": "GB/s",
                            "city": "湛江",
                            "value": "1039.939"
                        },
                        {
                            "unit": "GB/s",
                            "city": "茂名",
                            "value": "1056.141"
                        },
                        {
                            "unit": "GB/s",
                            "city": "江门",
                            "value": "1241.28"
                        },
                        {
                            "unit": "GB/s",
                            "city": "中山",
                            "value": "654.247"
                        },
                        {
                            "unit": "GB/s",
                            "city": "深圳",
                            "value": "779.377"
                        }
                    ],
                    "peakFlowData": [
                        {
                            "unit": "GB/s",
                            "city": "湛江",
                            "value": "1039.939"
                        },
                        {
                            "unit": "GB/s",
                            "city": "茂名",
                            "value": "1056.141"
                        },
                        {
                            "unit": "GB/s",
                            "city": "江门",
                            "value": "1241.28"
                        },
                        {
                            "unit": "GB/s",
                            "city": "中山",
                            "value": "654.247"
                        },
                        {
                            "unit": "GB/s",
                            "city": "深圳",
                            "value": "779.377"
                        }
                    ],
                    "cityFlowChartData": {
                        "sendingRateData": [
                            {
                                "unit": "GB/s",
                                "city": "江门",
                                "cityData": [
                                    {
                                        "data": 636.667,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "茂名",
                                "cityData": [
                                    {
                                        "data": 580.656,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "深圳",
                                "cityData": [
                                    {
                                        "data": 405.188,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "中山",
                                "cityData": [
                                    {
                                        "data": 327.465,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "湛江",
                                "cityData": [
                                    {
                                        "data": 578.207,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700798400
                                    }
                                ]
                            }
                        ],
                        "receivingRateData": [
                            {
                                "unit": "GB/s",
                                "city": "江门",
                                "cityData": [
                                    {
                                        "data": 636.667,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 636.667,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "茂名",
                                "cityData": [
                                    {
                                        "data": 580.656,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 580.656,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "深圳",
                                "cityData": [
                                    {
                                        "data": 405.188,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 405.188,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "中山",
                                "cityData": [
                                    {
                                        "data": 327.465,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 327.465,
                                        "time": 1700798400
                                    }
                                ]
                            },
                            {
                                "unit": "GB/s",
                                "city": "湛江",
                                "cityData": [
                                    {
                                        "data": 578.207,
                                        "time": 1700715600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700719200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700722800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700726400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700730000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700733600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700737200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700740800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700744400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700748000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700751600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700755200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700758800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700762400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700766000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700769600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700773200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700776800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700780400
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700784000
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700787600
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700791200
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700794800
                                    },
                                    {
                                        "data": 578.207,
                                        "time": 1700798400
                                    }
                                ]
                            }
                        ]
                    }
                }
            }
        },
    },
    /** 
     * @title 获取回复统计信息
     * @param {string} starTime 开始时间，必须
     * @param {string} endTime 结束时间，必须
     */
    {
        url: '/alarmReply/getReplyDetail',
        methods: 'post',
        response: (ctx) => {
            return {
                "code": 0,
                "msg": "操作成功",
                "data": {
                    "manufacturers": [
                        {
                            "name": "华为",
                            "replyNum": 2,
                            "avgResponseTime": "15秒",
                            "deliveriesNum": 2,
                            "replyRate": "100%"
                        }
                    ],
                    "replyNum": 2,
                    "avgResponseTime": "15秒",
                    "deliveriesNum": 2,
                    "totalReplyRate": "100%"
                }
            }
        },
    },
];
